{
    "projects" : [
        {
            "image" : "images/projects/Thesis.png",
            "title": "Senior Thesis",
            "bodyText": "- Impact of Quantum Computing on encryption.\n -   This paper explores the impact of quantum computing on traditional encryption methods, focusing on the vulnerabilities of the Rivest-Shamir-Adleman (RSA) algorithm. As quantum computers draw nearer to achieving practical application, their potential to break current cryptographic systems could drastically undermine data security.",
            "links": [
                {
                    "text": "PDF",
                    "href": "https://drive.google.com/file/d/1JmL_Bsk0narkyKy4ztiLhN86t-YZETzN/view?usp=drive_link"
                }
                
            ],
            "tags" : [
                "RSA",
                "Cryptography",
                "Quantum algorithms"
            ]
        },
        {
            "image" : "images/projects/truera-architecture-for-chatot-figure-1-1024x561.png",
            "title": "Vector Embeddings",
            "bodyText": "This project leveraged RAG Architecture, using the langchain libary in python. This project involved sourcing data from either pdf files or markdown files, then split to text chunks, coverted to vector embeddings using OpenAI api or llama 3 and stored within chromaDB a vector database.",
            "links": [
                {
                    "text": "Contact for source code",
                    "href": "mailto:joel.gilpin.4@gmail.com"
                }
                
            ],
            "tags" : [
                "Python",
                "langchain",
                "Openapi",
                "llama3api",
                "ChromaDB",
                "RAG"
                
            ]
        },
        {
            "image" : "images/projects/AR.jpg",
            "title": "Augmented Realilty",
            "bodyText": " Augmented reality (AR) application using Python and OpenCV. My goal was to project a 3D model onto a real-world image in real-time. I started by identifying a reference surface in the image, then used the ORB algorithm for feature extraction, description, and matching. By estimating the homography with RANSAC, I ensured accurate 3D projections onto the reference surface.",
            "links": [
                {
                    "text": "Contact for source code",
                    "href": "mailto:joel.gilpin.4@gmail.com"
                }
            ],
            "tags" : [
                "python",
                "Opencv"
                
            ]
        },
        {
            "title": "Windows Updates & wake on Lan",
            "bodyText": "I automated Windows updates and enabled Wake on LAN (WoL) to ensure systems stayed up-to-date and operational.\n- I leveraged Active Directory and Group Policy to push updates across the network, ensuring consistent configurations and compliance. I also enabled WoL by configuring BIOS/UEFI and network adapter settings, allowing remote wake-ups for off-hours updates. This approach minimized user disruption and maintained system readiness efficiently. ",
            "links": [
                {
                    "text": "Contact for source code",
                    "href": "mailto:joel.gilpin.4@gmail.com"
                }
            ],
            "tags" : [
                "Powershell",
                "Active Directory",
                "Networking"
            
            ]
        },
        {
            "title": "ACl rules ",
            "bodyText": "This project was to implement a flow cache and a simple flow firewall. These components were essential for network management and security, allowing for the efficient handling of network flows and the enforcement of access control rules.\n - Define Classes \n - Implement Hash Table \n - Implement Interval Tree \n - Parse ACL Rules \n - Packet Matching ",
            "links": [
                {
                    "text": "Contact for source code",
                    "href": "mailto:joel.gilpin.4@gmail.com"
                }
            ],
            "tags" : [
                "C++",
                "Networking",
                "Data structures"
            ]
        }
       
        
       
    ]
}